{"basics":{"name":"Muge Zhang","label":"PhD Applicant","email":"m.zhang1@student.fdu.edu","summary":"MS in Applied Computer Science with extensive research in microarchitectural performance analysis, AI-powered cache mechanisms, and optimization techniques for IoT and machine learning workloads."},"education":[{"institution":"Fairleigh Dickinson University","area":"Applied Computer Science","studyType":"MS","startDate":"2022-01-01","endDate":"2024-12-01","gpa":"3.92"},{"institution":"King’s College London","area":"War Studies and Philosophy","studyType":"BA","endDate":"2021-06-01","honors":"Upper Second-Class Honours"},{"institution":"Johns Hopkins University","area":"International Exchange Program","endDate":"2020-06-01","gpa":"4.00"}],"researchExperience":[{"name":"Energy Improvement Opportunities in Extended Reality (XR) Platforms","institution":"Fairleigh Dickinson University","startDate":"2023-10-01","summary":"Conducted micro-architectural analysis of pre-processing stages in ML workloads, identifying bottlenecks in data-heavy applications across vision, audio, text, and multimodal domains."},{"name":"Enhancing VLLM Performance through Cache Optimization","institution":"Fairleigh Dickinson University","startDate":"2024-05-01","summary":"Optimized VLLM's cache mechanism using an LFRU algorithm, improving performance over the benchmark."},{"name":"Improving Hierarchical Clustering in Large-Scale Data Systems","institution":"Fairleigh Dickinson University","startDate":"2024-04-01","summary":"Developed optimization methods for hierarchical clustering within the MapReduce framework, achieving a significant reduction in running time while maintaining high accuracy."}],"publications":[{"name":"A High Performance AI-powered Cache Mechanism for IoT Devices","publisher":"International Conference on Cyber-enabled Distributed Computing and Knowledge Discovery (CyberC), IEEE","releaseDate":"2024","summary":"AI-powered caching mechanism improving IoT devices' performance and privacy."},{"name":"Hierarchical Agglomerative Clustering Optimization for Massive Data","publisher":"International Conference on Scalable Computing and Communications (ScalCom), IEEE","releaseDate":"2024","summary":"Optimization method for large-scale data systems, achieving significant reductions in processing time."},{"name":"Microarchitectural Analysis of Pre-processing Stage in Machine Learning Workloads","publisher":"7th International Conference on Algorithms, Computing and Artificial Intelligence, IEEE","releaseDate":"2024","summary":"Microarchitectural analysis of ML workloads to optimize performance."}],"skills":[{"name":"Programming","keywords":["C/C++","Python","Matlab","Latex"]},{"name":"Machine Learning","keywords":["Pytorch","Keras","Cuda"]}],"honors":[{"title":"2024 Honors List","awarder":"Fairleigh Dickinson University"},{"title":"Department Commendation Letter","awarder":"King’s College London"}]}